276-study-message_25:02/app/views/conversations/index.html.erb

            <% if conversation.sender_id == current_user.id %>
            <% recipient = User.find(conversation.recipient_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]