276-study-message_25:02/app/controllers/conversations_controller.rb

SELECT "users".* FROM "users"
SELECT "conversations".* FROM "conversations"
---
    def index
        @users = User.all
        @conversations = Conversation.all

SELECT  "conversations".* FROM "conversations" WHERE ((conversations.sender2_id = NULL AND conversations.recipient_id = NULL) OR (conversations.sender2_id = NULL AND conversations.recipient_id = NULL))  ORDER BY "conversations"."id" ASC LIMIT 1
SELECT  1 AS one FROM "conversations" WHERE ("conversations"."sender_id" IS NULL AND "conversations"."recipient_id" IS NULL) LIMIT 1
INSERT INTO "conversations" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-02-22 01:34:26.402269"], ["updated_at", "2018-02-22 01:34:26.402269"]]
---
    def create
        if Conversation.between(params[:sender_id],params[:recipient_id]).present?
            @conversation = Conversation.between(params[:sender_id],
                                                 params[:recipient_id]).first
            else
                @conversation = Conversation.create!(conversation_params)