276-study-message_25:02/app/controllers/users_controller.rb

  def create								        #if saved, create user, log user in and redirect to user page, else reload
   	@user=User.new(user_params)
	if @user.save
---
INSERT INTO "users" ("name", "email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def show
      @user=User.find(params[:id]) #id is 1,2,3....
  end
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]