app/controllers/messages_controller.rb

def index
    @conversations= Conversation.all
    @users= User.all
    @messages = @conversation.messages
    if @messages.length > 10
---
SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = ?  [["conversation_id", 1]]