app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (course = 'CMPT123')
SELECT "posts".* FROM "posts"
---
	def index
    if params[:course]
      @posts = Post.where("course = ?", params[:course])
    else
      @posts = Post.all

INSERT INTO "posts" ("course", "content", "user", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["course", "CMPT276"], ["content", "let's be as tudyy buddyyyyyyy"], ["user", "dylan.wooods@gmail.com"], ["created_at", "2018-02-22 22:36:13.526876"], ["updated_at", "2018-02-22 22:36:13.526876"]]
---
  def create
  	@post = Post.new(post_params)
  	#@post.user = current_user.email
  	#render plain: params[:post].inspect
  	#render plain: post_params.inspect   #inspection
  	@post.save #saves posts